superSonic/archive/missile_coarse_20260719_125748_full/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    farfield_inflow
    {
        type            supersonicFreestream;
        pInf            $pressure;
        TInf            $temperature;
        UInf            $flowVelocity;
        gamma           1.4;
        value           $internalField;
    }

    farfield_outflow
    {
        type            inletOutlet;
        inletValue      uniform $flowVelocity;
        value           $internalField;
    }

    sides
    {
        type            inletOutlet;
        inletValue      uniform $flowVelocity;
        value           $internalField;
    }

    "(nose|fuselage|bodyFins|boosterFins)"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
