superSonic/archive/missile_coarse_20260719_125748_full/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $temperature;

boundaryField
{
    "(farfield_inflow|farfield_outflow|sides)"
    {
        type            inletOutlet;
        inletValue      uniform $temperature;
        value           $internalField;
    }

    "(nose|fuselage|bodyFins|boosterFins)"
    {
        type            zeroGradient;  // adiabatic wall
    }
}

// ************************************************************************* //
