superSonic/archive/missile_coarse_20260719_125748_full/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// v2512: removed deprecated root/case/instance/local fields from FoamFile header.
// scotch is the best default for snappyHexMesh-generated meshes with complex
// geometry — it minimises inter-processor boundaries automatically.

numberOfSubdomains  12;

method              scotch;

// Kept for reference if you want to switch methods without editing:
simpleCoeffs
{
    n               (2 2 3);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 1);
    delta           0.001;
    order           xyz;
}

// ************************************************************************* //
